class Config:
    PATH = "D:\projects\scrawling\driver\chromedriver.exe"

    HOMEPAGES = [
        ("Eileen", "https://space.bilibili.com/672342685/video", 36),
        ("Diana", "https://space.bilibili.com/672328094/video", 73),
        ("Bella", "https://space.bilibili.com/672353429/video", 51),
        ("Ava", "https://space.bilibili.com/672346917/video", 52),
        ("Carol", "https://space.bilibili.com/351609538/video", 15)
    ]

    EmojiCharac = {
        "流汗黄豆": "😅",
        "愤怒黄豆": "😡",
        "笑哭黄豆": "🤣",
        "皇家小丑": "🤡",
        "黄拳头": "👊",
        "白拳头": "👊🏻",
        "大哭黄豆": "😭",
        "给心心": "[给心心]",
        "愤怒恶魔": "👿",
        "口水黄豆": "🤤",
        "鲨鲨鲨": "🦈",
        "大哭": "[大哭]",
        "眼睛": "👀",
        "三心黄豆": "🥰",
        "双心黄豆": "😍",
        "单心黄豆": "😘",
        "摆手黄豆": "🤗",
        "润": "🏃",
        "害怕黄豆": "😰",
        "大笑": "😄",
        "寄吧": "🎤",
        "天使黄豆": "😇",
        "惊恐黄豆": "😱",
        "开香槟": "🍾",
        "奶瓶": "🍼",
        "生气": "[生气]",
        "舔爆": "👅",
        "失望黄豆": "😧",
        "我不好说卧槽": "🤭",
        "烧": "🥵",
        "跳舞": "💃",
        "高跟鞋": "👠",
        "击剑": "🤺",
        "哦呼": "[哦呼]",
        "狗头": "[doge]",
        "嘴硬": "[傲娇]",
        "笑哭": "[笑哭]",
        "抱拳": "[抱拳]",
        "无语": "[无语]",
        "嘉门": "[保佑]"
    }

    proxies = [
        {"http": "http://167.172.180.46:33555", "https": "https://167.172.180.46:33555"},
        {"http": "http://60.170.152.46:38888", "https": "https://60.170.152.46:38888"},
        {"http": "http://131.153.151.250:8003", "https": "https://131.153.151.250:8003"},
        {"http": "http://124.70.155.89:808", "https": "https://124.70.155.89:808"},
        {"http": "http://222.85.190.32:8090", "https": "https://222.85.190.32:8090"},
        {"http": "http://103.103.3.6:8080", "https": "https://103.103.3.6:8080"},
        {"http": "http://61.37.223.152:8080", "https": "https://61.37.223.152:8080"},
        {"http": "http://211.24.95.49:47615", "https": "https://211.24.95.49:47615"},
        {"http": "http://190.85.244.70:999", "https": "https://190.85.244.70:999"},
        {"http": "http://197.148.50.132:8080", "https": "https://197.148.50.132:8080"}

    ]
